Tekla.Structures.Model.Operations.Operation.ifc43ViewTypes
The IFC4.3 view types. Note: Not available anymore from TS2026 and onwards

Tekla.Structures.Model.Operations.Operation.CreateReportFromSelected(System.String,System.String,System.String,System.String,System.String)
Creates a report from the selected objects using the given template name and filename.
A template with the name given in the TemplateName parameter must exist in model folder or in the folder defined with the advanced option XS_TEMPLATE_DIRECTORY.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
See Tekla Structures Help for more information about reports.
TemplateName: The name of the report template to be used in report creation. The name must contain more than three characters.
FileName: The name of the created report. The name must contain more than three characters.
Title1: The first title for the created report.
Title2: The second title for the created report.
Title3: The third title for the created report.
Throws System.ArgumentNullException: Thrown when the TemplateName or FileName is null.
Throws System.ArgumentException: Thrown when the TemplateName or FileName is too short.
Returns: True if the report is created.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Model Model = new Model();
Beam B = new Beam(new Point(0,0,0), new Point(0,0,6000));
Beam B1 = new Beam(new Point(0,1000,0), new Point(0,1000,6000));
Beam B2 = new Beam(new Point(0,2000,0), new Point(0,2000,6000));
B.Insert();
B1.Insert();
B2.Insert();
ArrayList ObjectsToSelect = new ArrayList();
ObjectsToSelect.Add(B);
ObjectsToSelect.Add(B2);
Model.CommitChanges();
Tekla.Structures.Model.UI.ModelObjectSelector ModelSelector = new Tekla.Structures.Model.UI.ModelObjectSelector();
ModelSelector.Select(ObjectsToSelect);
Operation.CreateReportFromSelected("Assembly_list", "Assembly_list_selected.xsr", "MyTitle", "", "");
Operation.DisplayReport("Assembly_list_selected.xsr");
}
}

Tekla.Structures.Model.Operations.Operation.CreateReportFromAll(System.String,System.String,System.String,System.String,System.String)
Creates a report from all the objects using the given template name and filename.
A template with the name given in the TemplateName parameter must exist in model folder or in the folder defined with the advanced option XS_TEMPLATE_DIRECTORY.
If a path is not given in the filename, the file is created to the folder defined with the advanced option XS_REPORT_OUTPUT_DIRECTORY.
If the given folder does not exist, the report creation fails.
Internally, this method is asynchronous, and because of that the output file cannot be immediately available.
See Tekla Structures Help for more information about reports.
TemplateName: The name of the report template to be used in report creation. The name must contain more than three characters.
FileName: The name of the created report. The name must contain more than three characters.
Title1: The first title for the created report.
Title2: The second title for the created report.
Title3: The third title for the created report.
Throws System.ArgumentNullException: Thrown when the TemplateName or FileName is null.
Throws System.ArgumentException: Thrown when the TemplateName or FileName is too short.
Returns: True if the report is created.
The following example creates a report and then displays it. It is taken into account that the created file might not be immediately available.
using System.IO;
using System.Threading;
using Tekla.Structures.Model.Operations;
public class Example
{
public bool IfLockedWait(string FileName)
{
// try 10 times
int RetryNumber = 10;
while (true)
{
try
{
using(FileStream FileStream = new FileStream(
FileName, FileMode.Open,
FileAccess.ReadWrite, FileShare.ReadWrite))
{
byte[] ReadText = new byte[FileStream.Length];
FileStream.Seek(0, SeekOrigin.Begin);
FileStream.Read(ReadText, 0, (int)FileStream.Length);
}
return true;
}
catch (IOException)
{
// wait one second
Thread.Sleep(1000);
RetryNumber--;
if(RetryNumber == 0)
return false;
}
}
}
public void Example1()
{
Operation.CreateReportFromAll("Assembly_list", "Assembly_list.xsr", "MyTitle", "", "");
if(File.Exists("Assembly_list.xsr"))
{
// wait until Tekla Structures has unlocked the file, or timeout
if(IfLockedWait("Assembly_list.xsr"))
{
// display the report
Operation.DisplayReport("Assembly_list.xsr");
}
}
}
}